#include <stdio.h>

int main() {
    int a = 10;
    int *p = &a; // p == &a는 주소
    // 포인터 기본
    printf("a의 값: %d\n", a);
    printf("a의 주소: %p\n", &a);
    printf("p가 가리키는 값: %d\n", *p);
    printf("p의 값 (주소): %p\n", p);

    return 0;
}

//       a                    p
//    ┌─────┐              ┌─────────┐
//    │ 10  │              │ 0x1000  │
//    └─────┘              └─────────┘
//     ↑                        │
//     │                        │
//  &a (주소)              p (주소값)
//     │                        │
//     └──────── *p (값) ───────┘

// a     = 10        (값)
// &a    = 0x1000    (a의 주소)
// p     = 0x1000    (p가 저장한 주소 = &a 와 같음)
// *p    = 10        (p가 가리키는 a의 값)